Revit 2027 API
BuiltInFailures.JoinElementsFailures.StairsComponentTypeUnsupportedError Property
 The selected stair type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsComponentTypeUnsupportedError { get; }
Public Shared ReadOnly Property StairsComponentTypeUnsupportedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsComponentTypeUnsupportedError {
	FailureDefinitionId^ get ();
}
static member StairsComponentTypeUnsupportedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace